Revit 2027 API
PipePressureDropData.InsideDiameter Property
 The inside diameter of the pipe. Units: (ft).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double InsideDiameter { get; }
Public ReadOnly Property InsideDiameter As Double
	Get
public:
property double InsideDiameter {
	double get ();
}
member InsideDiameter : float with get
Property Value
Double
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace